ЧартерEDT.Расширение1/src/Documents/ChangeRoom/ChangeRoom.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fedfdb53-97f4-484f-a6f8-b777d9d19086">
  <name>ChangeRoom</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НомерКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c38b0648-9193-4cc0-a8c6-1936eeb10fa3">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ffc7558-f2aa-4de2-8518-2142016a59d0">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e74cc2dd-56b2-4416-8abf-f8cf8bcaa8a8">
    <name>IsVirtual</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1d21db74-604d-453c-bc59-c7afc99dc32a">
    <name>OperationEndDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a96ccc6f-dd78-41a4-9afc-82352d8d82aa">
    <name>RoomGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9996f2b9-a3a6-4f49-ba77-3d2a8059647c">
    <name>RoomNumber</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="238c8086-0d24-4d54-84dc-c83ba09c8054">
    <name>NumberOfBedsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de233e21-9fe0-4a41-bb29-6f8dcf4a5775">
    <name>NumberOfPersonsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41bd7a4a-793e-4300-ad93-c4e11f829bf2">
    <name>SortCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="40d3d3bb-3108-4c06-a493-8593748439b6">
    <name>Remarks</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f6a3772-86d8-4576-9afc-214fbe57b035">
    <name>Author</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eff1623-c47a-49bb-8067-75689b367aba">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/Documents/ChangeRoom/ObjectModule.bsl
&ChangeAndValidate("ChangeRoom")
Procedure Расш1_ChangeRoom(pCancel)
	// Room atributes should be changed only if current document is the last one
	vRoomObj = Room.GetObject();
	vRoomAttr = vRoomObj.pmGetRoomAttributes('39991231235959');
	For Each vRoomAttrRow In vRoomAttr Do
		If ValueIsFilled(vRoomAttrRow.DocRecorder) Then
			If vRoomAttrRow.DocRecorder.Date > Date Then
				Return;
			ElsIf vRoomAttrRow.DocRecorder.Date = Date And vRoomAttrRow.DocRecorder <> Ref Then
				Raise NStr("en='There is already one <Add room> or <Change room> document for the date choosen! You can not create more then one <Add/Change room> documents for the same moment. Please change date of the current document.';
				|ru='Для указанного номера уже существуют документы <Ввод номера в НФ> или <Изменить номер> с такой же датой документа! У одного номера в один момент времени может быть только один документ ввода в НФ/изменения реквизитов номера. Пожалуйста измените дату текущего документа.';
				|de='Für das angegebene Zimmer wurde bereits das Dokument <Eingabe des Zimmers im Zimmerbestand> oder <Zimmer ändern> erstellt! Für ein Zimmer für einen Zeitpunkt muss es nur ein Dokument über die Eingabe in den Zimmerbestand/Änderung von Zimmerrequisiten geben. Bitte ändern Sie das Datum des aktuellen Dokuments.'");
			EndIf;
		EndIf;
	EndDo;

	// Change current room attributes
	vRoomObj.Owner = Hotel;
	vRoomObj.Description = RoomNumber;
	vRoomObj.Parent = RoomGroup;
	vRoomObj.RoomType = RoomType;
	vRoomObj.NumberOfBedsPerRoom = NumberOfBedsPerRoom;
	vRoomObj.NumberOfPersonsPerRoom = NumberOfPersonsPerRoom;
	vRoomObj.OperationEndDate = OperationEndDate;
	vRoomObj.SortCode = SortCode;
	#Вставка
	vRoomObj.НомерКвартиры = НомерКвартиры;
	#КонецВставки
	If Not IsBlankString(Remarks) Then
		vRoomObj.Remarks = Remarks;
	EndIf;
	vRoomObj.isVirtual = IsVirtual;

	vRoomObj.Write();

	// Remove records from the room change history
	UndoPosting(pCancel);

	// Add record to the room change history
	pmWriteToRoomChangeHistory();
EndProcedure

&ChangeAndValidate("pmFillAttributesWithDefaultValues")
Procedure Расш1_pmFillAttributesWithDefaultValues()
	// Fill author and document date
	pmFillAuthorAndDate();
	// Fill room attributes
	If ValueIsFilled(Room) Then
		vRoomObj = Room.GetObject();
		vRoomAttr = vRoomObj.pmGetRoomAttributes(Date);
		For Each vRoomAttrRow In vRoomAttr Do
			Hotel = vRoomAttrRow.Hotel;
			RoomGroup = vRoomAttrRow.RoomGroup;
			RoomNumber = vRoomAttrRow.RoomNumber;
			RoomType = vRoomAttrRow.RoomType;
			NumberOfBedsPerRoom = vRoomAttrRow.NumberOfBedsPerRoom;
			NumberOfPersonsPerRoom = vRoomAttrRow.NumberOfPersonsPerRoom;
			OperationEndDate = vRoomAttrRow.OperationEndDate;
			SortCode = Room.SortCode;
			Remarks = Room.Remarks;
			#Вставка
			НомерКвартиры = Room.НомерКвартиры;
			#КонецВставки
			IsVirtual = vRoomAttrRow.IsVirtual;
		EndDo;
	EndIf;
	If Not ValueIsFilled(Hotel) Then
		Hotel = SessionParameters.CurrentHotel;
	EndIf;EndProcedure
